export const AGREEMENT_MESSAGE = {
  CONTENT_TEXT: 'ข้าพเจ้าได้อ่านข้อความข้างต้นแล้วยอมรับว่าถูกต้องเป็นความจริงทุกประการ หากต่อมาภายหลังสำนักงานประกันสังคมตรวจสอบพบว่า ข้อมูลข้างต้นไม่ถูกต้อง สำนักงานประกันสังคมสามารถยกเลิกการขึ้นทะเบียนผู้ประกันตนตามมาตรา 40 ทางอิเลคทรอนิกส์ของข้าพเจ้าได้',
  DECISION_TEXT: 'ข้าพเจ้าได้อ่านข้อความข้างต้น และยอมรับเงื่อนไขและข้อตกลง'
}

export const CHECK3339_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'ท่านไม่มีสิทธ์สมัครเป็นผู้ประกันตนตามมาตรา 40 เนื่องจากท่านเป็นผู้ประกันตนตามมาตรา 33 หรือมาตรา 39'
}

export const CHECK40_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'มีข้อมูลอยู่ในระบบมาตรา 40 แล้ว'
}

export const EGA_INVALID_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'ข้อมูลไม่ถูกต้อง'
}

export const EGA_AGE_LESS15_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'ไม่สามารถสมัครเป็นผู้ประกันตนตามมาตรา 40 ได้ เนื่องจากผู้สมัครมีอายุไม่ครบ 15 ปี ณ วันที่ยื่นแบบขึ้นทะเบียน (ผู้สมัครเป็นผู้ประกันตนตามมาตรา 40 ต้องมีอายุ 15 – 60 ปี ณ วันที่สมัครและชำระเงินสมทบงวดแรก)'
}

export const EGA_AGE_MORE60_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'ไม่สามารถสมัครเป็นผู้ประกันตนตามมาตรา 40 ได้ เนื่องจากผู้สมัครมีอายุ 60 ปี ณ วันที่ยื่นแบบขึ้นทะเบียน (ผู้สมัครเป็นผู้ประกันตนตามมาตรา 40 ต้องมีอายุ 15 – 60 ปี ณ วันที่สมัครและชำระเงินสมทบงวดแรก)'
}

export const EGA_SEARCH_ALERT = {
  HEADER_TEXT: 'ไม่พบข้อมูล',
  CONTENT_TEXT: 'ไม่มีข้อมูลการสมัครเป็นผู้ประกันตนตามมาตรา 40'
}

export const REGISTERED_ALERT = {
  HEADER_TEXT: 'ลงทะเบียนเรียบร้อย',
  CONTENT_TEXT: 'สำนักงานประกันสังคมได้รับข้อมูลการสมัครเป็นผู้ประกันตนตามมาตรา 40 ของท่านเรียบร้อยแล้ว และจะดำเนินการแจ้งผลกลับไปใน e-mail ของท่านภายใน 5 วันทำการ'
}

export const MEMBER_ALERT = {
  HEADER_TEXT: 'ไม่สามารถลงทะเบียน',
  CONTENT_TEXT: 'เนื่องจากเป็นสมาชิกกองทุนบำเหน็จบำนาญข้าราชการ กองทุนบำเหน็จบำนาญข้าราชการกรุงเทพมหานคร กองทุนบำเหน็จบำนาญข้าราชการส่วนท้องถิ่น หรือเป็นสมาชิกกองทุนรัฐวิสาหกิจ หรือหน่วยงานอื่นของรัฐ'
}

export const ERROR_ALERT = {
  HEADER_TEXT: 'เกิดข้อผิดพลาด',
  CONTENT_TEXT: 'ไม่สามารถลงทะเบียนได้ในขณะนี้ กรุณาลงทะเบียนใหม่ในภายหลัง'
}

export const REGISTER_CONFIRM_ALERT = {
  HEADER_TEXT: 'ยืนยันการลงทะเบียน',
  CONTENT_TEXT: 'คุณต้องการลงทะเบียนผู้ประกันตนตามมาตรา 40 ใช่หรือไม่'
}
